{"title": "30-Day Challenge #5: Reduce your future health (and current habit) expenses! (May, 2023)", "score": "22", "id": "134luae", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/134luae/30day_challenge_5_reduce_your_future_health_and/", "num_comments": "15", "body": "# 30-day challenges\n\nWe are pleased to continue our 30-day challenge series. Past challenges can be found [here](https://www.reddit.com/r/personalfinance/wiki/30daychallenges).\n\nThis month's 30-day challenge is to **Reduce your future health (and current habit) expenses!**\n\n#Why is this important?\n\n[Healthcare costs past retirement age are expensive!](http://www.aarp.org/health/medicare-insurance/info-12-2012/health-care-costs.html) In addition to this, unhealthy lifestyles can have a negative effect on your current financial situation. There is already a lot of overlap between personal finance and lifestyle choices, so let's take a look at some immediate improvements you can make for your future.\n\n### Reducing your Risk of Heart Disease (Cost [$3,000 - $38,501](http://www.nber.org/digest/oct98/w6514.html))\n\nLeading a healthy lifestyle is the biggest way to reduct your risk of heart disease. Among these lifestyle choices:\n\n* Not using tobacco ([Source 1](https://www.cdc.gov/chronicdisease/resources/publications/aag/pdf/2016/aag-heart-disease.pdf), [Source 2](http://www.webmd.com/heart-disease/guide/heart-disease-risk-factors#1), [Source 3](http://www.mayoclinic.org/diseases-conditions/heart-disease/in-depth/heart-disease-prevention/art-20046502?pg=1))\n* Being physically active (Same sources as above)\n* Maintaining a healthy weight (Same sources as above)\n* Making healthy food choices (Same sources as above)\n* Stress management ([Source](http://www.heart.org/HEARTORG/HealthyLiving/StressManagement/HowDoesStressAffectYou/Stress-and-Heart-Health_UCM_437370_Article.jsp#.WQVU3PkrJpg))\n\nSome of the above also have a side effect of immediate financial impact:\n\n* Not using tobacco: $1,610 - $3,750 per year ([Source](http://www.tobaccofreekids.org/research/factsheets/pdf/0337.pdf))\n* Making healthy food choices: comparative savings of $14 per meal (fast food, family of 4) ([Source](http://recipes.howstuffworks.com/menus/how-much-can-you-save-by-not-eating-fast-food.htm))\n\n### Reducing your Risk of Cancer (Cost [$19,901 - $60,885 per annum](https://www.aflac.com/individuals/benefits-estimator/source/default.aspx))\n\nThe lifestyle choices below have been shown to reduce the risk of cancer:\n\n* Not using tobacco ([Source 1](https://www.cdc.gov/cancer/dcpc/prevention/other.htm), [Source 2](http://preventcancer.org/blog/education/10-ways-to-reduce-your-cancer-risk/), [Source 3](http://www.mayoclinic.org/healthy-lifestyle/adult-health/in-depth/cancer-prevention/art-20044816?pg=11), [Source 4](http://www.webmd.com/cancer/features/8-ways-to-lower-cancer-risk#1))\n* Maintaining a healthy weight (Same sources as above)\n* Limiting alcohol intake (Same sources as above)\n* Get screened for cancer and/or Hepatitis C (Same sources as above)\n* Protect yourself from the sun (Same sources as above)\n\nNote that a few of these are carried over from the first section on heart disease! There are some immediate financial impacts of reducing your alcohol intake: You can save about [$750 USD per year](http://www.thisismoney.co.uk/money/bills/article-2532579/How-Dry-January-save-Seven-reasons-alcohol-month.html) by going dry.\n\n### Reducing chronic lower respiratory diseases (Cost [$6,000 more in medical care than those without](https://www.cdc.gov/features/ds-copd-costs/))\n\nThe lifestyle choices below have been shown to reduce the risk of COPD:\n\n* Not smoking ([Source 1](https://www.cdc.gov/copd/index.html), [Source 2](https://www.nhlbi.nih.gov/health/health-topics/topics/copd/prevention), [Source 3](http://www.webmd.com/lung/copd/tc/chronic-obstructive-pulmonary-disease-copd-prevention))\n* Avoid respiratory infections and get vaccinated (Same sources as above)\n* Avoid home and workplace air pollutants, lung irritants, or dust (Same sources as above)\n* Exercise regularly to improve your breathing\n* Address allergic conditions\n\n# Related Subreddits:\n\n* /r/getdisciplined\n* /r/fitness and /r/xxfitness\n* /r/stopsmoking and /r/stopdrinking\n* /r/eatcheapandhealthy, /r/recipes, /r/slowcooking, and /r/mealprepsunday\n* /r/health\n\n# Challenge success criteria\n\nYou've successfully completed this challenge once you've done 2 or more of the following things:\n\n* Reduce or stop any tobacco habits\n* Reduce or stop your alcohol intake\n* Pick up an outdoor hobby (walking, hiking, running, swimming, biking, etc.) and don't forget the sunscreen!\n* See your primary care physician for a checkup. Ask for recommendations on lifestyle improvements, sleep quality, stress reduction, and if applicable, drug use.\n    * Skin checks (Melanoma is dangerous!)\n    * [See here for a recommended list of cancer screenings](https://www.cancer.org/healthy/find-cancer-early/cancer-screening-guidelines/american-cancer-society-guidelines-for-the-early-detection-of-cancer.html)\n    * [See here for a recommended list of vaccinations](https://www.vaccines.gov/who_and_when/adults/index.html)\n    * Women: Mammograms are recommended starting at age 40\n    * Men: Prostate exams are recommended starting at age 40 - 50\n* Increase your frequency of cooking at home and eat healthier foods\n* Start a fitness journal\n* Reduce time spent on watching television, playing video games, and other idle habits\n* Take time off of work to reduce stress (Public holidays such as Memorial Day, Victoria Day, May Day, or other holidays from your country of residence don't count!)", "created": "1682946002.0"}{"title": "Weekday Help and Victory Thread for the week of May 01, 2023", "score": "23", "id": "134j9w8", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/134j9w8/weekday_help_and_victory_thread_for_the_week_of/", "num_comments": "213", "body": "### If you need help, please check the [PF Wiki](https://www.reddit.com/r/personalfinance/wiki/index) to see if your question might be answered there.\n\nThis thread is for personal finance questions, discussions, and sharing your success stories:\n\n1. *Please make a top-level comment if you want to ask a question! Also, please don't downvote \"moronic\" questions!* If you have not received your answer within 24 hours, please feel free to [start a discussion](http://old.reddit.com/r/personalfinance/submit?selftext=true).\n\n2. *Make a top-level comment if you want to share something positive regarding your personal finances!*\n\n**A big thank you to the many PFers who take time to answer other people's questions!**", "created": "1682938803.0"}{"title": "Moving Back In With My Parents For A Year Changed My Life", "score": "1079", "id": "137v2p5", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137v2p5/moving_back_in_with_my_parents_for_a_year_changed/", "num_comments": "281", "body": "Hi everyone, \n\nFirst time posting here but I think is a really cool thing to post. \n\nI'm 27 and getting married in September. My fiance (26) and I make 130k together now, but we've been broke for the majority of our lives. We've been together for about 10 years and the only thing holding us back from getting married was strictly financial. \n\nWe were living in an apartment together in 2020, paying about $1500 a month. My fiance was working at her first job as a Social Worker, and I was still in school getting my Master's in Computer Science. She was already done with her Master's and starting to get some money.\n\nWhile in school, I was also working full-time at a restaurant, making roughly 30k a year. Of course, COVID hit and I had to go on unemployment while all the restaurants were shut down. I had to use a lot of my credit cards and ended up stacking up about 10-15k in credit cards. So I started panicking and applied for any and all software-related jobs out there. Luckily I chose a high demanding field to work in. \n\nUnfortunately, during my college years I worked up about 118k in student loan debt. And that's with going to community college for two years and commuting to school the rest of the other years. \n\nAfter almost an entire year of job searching and rejection after rejection, I finally landed a software engineer gig. The base pay was 63k, but that wasn't the best part. My employer contributes to paying my student loans off too. It will take roughly 10 years to pay that all off (about 8 years now). \n\nSo then I didn't have any student loan debt to worry about for the time being. After about 6 months of working there, I got YNAB just to see how chaotic my life truly was at that time. My net worth was about -160k. Absolutely terrifying. \n\nSo I started reading up on getting out of debt quickly and started watching every youtube video known to man about getting out of debt. \n\nThe biggest thing that made me realize I gotta stop using credit cards was when I went to the jewelry store for my fiance's engagement ring and had to open up another line of credit. Once I left that store, I told myself this was the last credit card I ever use. \n\nAfter that, every other check started getting thrown at my debts. I never spent any money unless I absolutely had to. I started doing doordash and uber eats after work, working maybe 60-70 hours a week. \n\nThen we really wanted to get out of our shitty apartment, so we started looking at house prices online. YIKES. We thought we were going to have to rent forever while trying to pay off this wedding. We really didn't want to return back from our honeymoon to our apartment that we hated. \n\nI finally broke down all the numbers to my fiance: we either postpone the wedding for a house, postpone the house for a wedding, OR..... move back in with our parents and get both. \n\nIt took a TON of convincing, but my fiance eventually agreed to it. When we moved out, I had about 2k to my name. \n\nAfter a little over a year of moving back home, slamming down debts and not spending any money except for the down payment and the wedding, I am now sitting in my newly-built house with 30k in the bank, zero debt (aside from the student loans being paid by my employer) and the wedding completely paid off. Got 15k in retirement, building our emergency fund and finally enjoying ourselves. Net worth went from -160k to -50k in a year. Still got work to do, but man are we such in a better situation because we swallowed our pride and did the right thing for us. \n\ntl;dr - Moving back in with our parents really saved us from working for the rest of our lives and gave us a tremendous boost. It's okay to go back home if it means that you won't have to work for the rest of your lives.", "created": "1683223652.0"}{"title": "Possibly buying a house this summer. Would really appreciate another few sets of eyes for my Housing Budget process!", "score": "337", "id": "137kuml", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137kuml/possibly_buying_a_house_this_summer_would_really/", "num_comments": "246", "body": "Hey everyone, thanks for reading this!\n\nI'm a teacher and I will make a gross income of **$48,997** in FY24 and my wife will start a job as a school psychologist in September making **$52,000/year** until January and then **$59,000/year** after. We are looking at getting an FHA loan, which requires at least **3.5%** down.\n\nI averaged her salary numbers and made it **$55,500** for her gross income which makes our household gross income **$104,497** for FY24. I currently have around **$6k** saved up for a down payment and plan to have up to **$10,643** in July, and we have to move out of our rental on August 1.\n\nI am going by the rule that I've heard, which is that your monthly mortgage budget should be less than **28%** of your gross monthly income, which for us would be **$2,438/mo**. \n\nUsing a mortgage calculator, I calculated that my monthly mortgage for a **$300,000** house at **6.5% APR** and a **$10,643** down payment would be **$2,242**, which accounts for **$150 for PMI**, **$66 for homeowners insurance**, and **$200 for property taxes.** \n\nI want to make sure before we start looking seriously for houses that there's nothing (other than closing costs/utilities) that I'm failing to account for. Any input would be greatly appreciated. \n\n\\- Also worth noting, my salary will go up yearly for adding years of creditable service to my contract, so our gross yearly income SHOULD continue to increase, and even more so when I get my Master's degree and professional teaching certificate. \n\nPlease let me know if you think my budget is too aggressive, if there's anything I'm not considering, or any other input you might have!\n\nThank you all for your help.", "created": "1683207253.0"}{"title": "I'm 50 and I want to retire today. How will SS be calculated when I decide to withdraw from it? say at 65.", "score": "119", "id": "137omph", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137omph/im_50_and_i_want_to_retire_today_how_will_ss_be/", "num_comments": "66", "body": "How would SS get calculated?  What if I have a side income that incomes me about 5K a year.  Would that destroy my SSN calculation? (cause they go by previous incomes?)\n\nI'm in the US/NY", "created": "1683212343.0"}{"title": "Am I being scammed by my parents?", "score": "2015", "id": "1370ovj", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/1370ovj/am_i_being_scammed_by_my_parents/", "num_comments": "580", "body": "One of my parents is asking me for my SSN to “close out an account.”\n\n“I have an investment account with small balance I took out in your name. Small balance. It was to put toward your college but I paid for that so I want to zero it out.”\n\nI’m not sure why one would need my SSN to close the account if it’s theirs…anyone have any clue what could be going on?\n\n\nUPDATES:\n\nI’m an adult. This parent is elderly. This parent has an untruthful history especially with money. \n\nIt’s a joint account with an investment firm. I’ve asked for the details to close it myself and put a freeze on my credit. \n\nAnd fwiw, this parent only kinda paid for college but it’s chill that they remember doing so lol. I remember credit cards and loans I was paying off for years by myself while this person was starting a new family in another state like byeeeeee.", "created": "1683150597.0"}{"title": "Low salary but good at saving, best options and plan for a young dude?", "score": "69", "id": "137r334", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137r334/low_salary_but_good_at_saving_best_options_and/", "num_comments": "93", "body": "22 yo. New government/public sector worker making double what I made at my old job. Probably $20-22k after taxes and 401a comes out. \n\nI have a matched 401a + 457b, $30/mo HSA, and low cost health insurance ($100/mo total) that automatically comes out of my check leaving me with $1700/mo free to use. Rent and bills comes to $650ish. \n\nNo degree or college.\n\nOne credit card with a 720ish score.\n\nIn liquid savings: $500 (had more but burned through moving to a cheaper state and living while not working)\n\nFuture down payment savings: $20k\n\nAssets: $4750 owned car and $700 in stocks \n\nI'm applying for gig jobs (uber eats mainly) to bump my cash flow on weekends, and thinking about detailing for cash too.\n\nAny other suggestions? Want to buy a house in 5-8yrs.", "created": "1683214943.0"}{"title": "$7k from summer job; pay down student loans or save for retirement/ long-term?", "score": "46", "id": "137qqsm", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137qqsm/7k_from_summer_job_pay_down_student_loans_or_save/", "num_comments": "47", "body": "I’m graduating undergrad this spring and have gotten a job that will pay around $10k for the summer. I will be going to graduate school next fall, and other than a modest living-expense stipend will not have any income. \n\nAfter buying a car and some other necessities, I’ll have around 7k left (I’ll be living at home with my parents, so no rent or anything) \n\nI likely will be able to defer student loans until after I graduate from my master’s program. They're around $28k in total, all federal, all 0% interest currently. \n\nShould I put the 7k into paying off my loans, or would it be more profitable / prudent long-term to put most of it into some stable long-term retirement-ish investments? I don't really have savings of any sort at the moment.", "created": "1683214283.0"}{"title": "When is it too late to invest in retirement?", "score": "628", "id": "1375005", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/1375005/when_is_it_too_late_to_invest_in_retirement/", "num_comments": "439", "body": "I’m 30 years old. I have no retirement savings to speak of. I have about 5k in a savings account. My paychecks around $2,000-2,400 every two weeks. My expenses are about $1,200/month. I’m starting to get my life in order. I have no house to speak of and my car is paid off but very old (1999 Chevy Lumina). I have no debt to speak of. I’m wondering is it too late to start a retirement and get the same money value when I start to draw money from a retirement fund? I know I need to think about a house now but until I increase my income I don’t see that happening so I’m going to get my finances secured but I’m starting to look and realize I might not be able to keep up the same lifestyle because I’ve started too late. Is that something I need to consider or will I be ok?", "created": "1683161306.0"}{"title": "Need a Game Plan, I got laid off an hour ago. Completely out of left field.", "score": "26", "id": "137t5xy", "subreddit": "personalfinance", "url": "https://www.reddit.com/r/personalfinance/comments/137t5xy/need_a_game_plan_i_got_laid_off_an_hour_ago/", "num_comments": "11", "body": "1) I definitely have more than 6-12 months saved up in emergency savings.\n2) I've got a 401k through a group called Human Interest, but I genuinely don't know if I should leave it or not? Or do I roll it over somewhere?\n3) Apparently health insurance is paid until the end of the month, should I just start mass booking doctors appointments right now?\n4) Can I apply for unemployment immediately? Or do I wait?\n\nI'm a bit rattled, so can anyone tell me if I'm missing anything? I'm sorry if this is dumb sounding, I'm just trying to process what I need to prepare starting now.\n\nEDIT: Thank you all for taking the time to respond and help me with this. I'll be replying to everyone once I've calmed down later today, and walked around a bit to clear my head. Thank you so much, everyone :)", "created": "1683219516.0"}